/**********************************************************************************
確認3的倍數不用/和%
在N base的系統中測試能否被(N+1)整除的方式是將偶數位數的和跟奇數位數的和相減，看是否能被(N+1)整除。
證明可以看11的倍數判斷
ex:5236 
= 5*1000+2*100+3*10+6*1
= 5*(91*11-1)+2*(9*11+1)+3*(1*11-1)+6*(1)
= 2*1+6*1-(5*1+3*1)
= 2+6-(5+3) = 0
同理可以用2 base 的bit位數判斷是否被 3整除
**********************************************************************************/
#include <stdio.h>
#include <stdlib.h>

int multipleOf3(int num) {
  if (num < 0) num = -num;

  if (num == 0) return 1;
  if (num < 3) return 0;

  int odd = 0, even = 0;
  while (num != 0) {
    odd += num & 1;
    num >>= 1;
    even += num & 1;
    num >>= 1;
  }

  return multipleOf3(even - odd);
}

int main() {
  printf("%d\n", multipleOf3(32));
  return 0;
}
