/**********************************************************************************
不用if實作三元運算子  x?y:z
(1)把x做成mask，如果x=0就回傳0否則就回傳-1
- 方法如下：
- 準備一個(x >> 31)：如果是正整數就會回傳000...如果是負整數就會回傳111...
- 準備一個(~x+1)：如果是0就會回傳000...如果是正整數就會回傳1.....
- 然後再把(~x+1)>>31就會得到如果是0就會回傳000...如果是正整數就會回傳111...
- 如此一來(x >> 31)|((~x+1)>>31)就除了0之外都會回傳111...了
(2)用mask來選擇要遮住y或z
- (mask&y) | (~mask&z)
- 如果mask是000...就會遮住y因為都是0，反之就會遮住z
**********************************************************************************/
#include <stdio.h>
#include <stdlib.h>

int ternary(int x, int a, int b) {
  int mask = (x >> 31) | ((~x + 1) >> 31);
  return (mask & a) | (~mask & b);
}

int main() {
  int a = 123;
  int b = 456;
  printf("%d\n", ternary(1, a, b));
  printf("%d\n", ternary(-1, a, b));
  printf("%d\n", ternary(0, a, b));
  return 0;
}
